[
  { "maori": "Kei te māuiui ahau ināianei. Kei te māuiui taku puku me taku upoko. Kei ahau tētahi hui ki te rata ā te Rāapa, i te 1 karaka o te ahiahi", "english": "I am feeling unwell at the moment. My stomach and head are sore. I have a doctor's appointment on Wednesday at 1 pm in the afternoon" },
  { "maori": "Kei te whakaputa haruru kē taku motokā. Nō reira, ka kawe au i tērā ki te mihini motokā ā te wiki kei muri. Kei te tūmanako ahau kāore e tino nui te utu", "english": "My car is making a funny noise. Therefore, I am taking it to the mechanic next week. I hope it does not cost too much" },
  { "maori": "Āpōpō, ka haere au ki te toa hoko kai me taku tuahine. E hiahia ana māua ki te hoko kai mō te hākari o te Rāhoroi. Ka tunu māua i ngā kai, ā, ka whāngai māua i ngā manuhiri katoa", "english": "Tomorrow, I am going to the supermarket with my sister. We want to buy food for Saturday's feast. We will cook the food and feed all the guests" },
  { "maori": "I te wiki kua pahure ake nei, i haere ahau ki Rotorua ki te toro i aku tipuna. I noho au ki reira mō ngā rā e toru. He rawe ngā wā katoa i reira. I haere mātou ki ngā waiariki me te whare taonga", "english": "Last week, I went to Rotorua to visit my grandparents. I stayed there for three days. We had a wonderful time. We went to the hot pools and the museum" },
  { "maori": "Kei te ako ahau i te reo Māori i te kura wānanga. He uaua ētahi wā, engari he pai ki ahau. Kei te mōhio ahau he mea nui te reo mō tōku whānau me tōku hapori", "english": "I am learning Māori language at university. It is difficult sometimes, but I like it. I know that the language is important for my family and my community" },
  { "maori": "Ko tōku tuakana, kei te mahi ia i te tāone. He kaiwhakaako ia i te kura tuatahi. He pai ki a ia tana mahi, engari he roa te haere mai i te kāinga ki te mahi ia rā", "english": "My older sibling works in the city. They are a teacher at a primary school. They like their job, but the commute from home to work each day is long" },
  { "maori": "I te tau kua pahure, i haere tōku whānau ki Te Puku o te Ika. I noho mātou i tētahi whare rūma tata ki te moana. I whakatā mātou, i kaukau i te moana, ā, i kai mātou i ngā kai tino pai", "english": "Last year, my family went to Wellington. We stayed in a hotel near the beach. We relaxed, swam in the ocean, and ate really good food" },
  { "maori": "Kei te whakaaro ahau ki te hoko i tētahi whare hou i te tau kei te heke mai. Kei te tiaki moni ahau ināianei. E hiahia ana ahau ki tētahi whare e tata ana ki te mahi me ngā kura tika mō āku tamariki", "english": "I am thinking about buying a new house next year. I am saving money now. I want a house that is close to work and has good schools for my children" },
  { "maori": "I te pō inanahi, i haere mātou ki te whare kānapanapa ki te mātakitaki i tētahi kiriata hou. He pai rawa atu! I kai mātou i ngā popcorn me ngā inu. Kua roa te wā kāore mātou i haere ki te whare kānapanapa", "english": "Last night, we went to the cinema to watch a new film. It was really good! We ate popcorn and drinks. It has been a long time since we went to the cinema" },
  { "maori": "Ko taku mahi kei te tino pukumahi i tēnei wā. Kei ahau ētahi kaupapa nui me whakaoti i mua i te mutunga o te marama. Kei te mahi au i ngā hāora roa ia rā, engari ka mutu pea ā te wiki kei muri", "english": "My work is very busy at the moment. I have some big projects to complete before the end of the month. I am working long hours each day, but it will probably finish by next week" },
  { "maori": "Ā te Kirihimete, ka haere tōku whānau katoa ki te marae o Ngāti Porou. Ka hui tātou katoa ki reira mō te Kirihimete me te Tau Hou. He wā rawe tēnā ki te whakakotahi i te whānau whānui", "english": "At Christmas, my whole family goes to the Ngāti Porou marae. We all gather there for Christmas and New Year. It is a wonderful time to bring the extended family together" },
  { "maori": "Kei te ako taku tamāhine i te kanikani kapa haka i te kura. Kua tino koa ia. Kei te ako ia i ngā waiata, i ngā haka, me ngā poi. Ā te tau, ka tū rātou ki te whakataetae", "english": "My daughter is learning kapa haka at school. She is very happy. She is learning the songs, haka, and poi. At the end of the year, they will perform at a competition" },
  { "maori": "I tēnei ata, ka oho au i te 6 karaka. I tunu au i te parakuihi mōku anō me taku hoa. I kai mātou, ā, ka haere au ki te mahi mā runga i te pahi. He pai te haere mai o te rangi", "english": "This morning, I woke up at 6 o'clock. I cooked breakfast for myself and my partner. We ate, and then I went to work by bus. The weather on the way was good" },
  { "maori": "Kei te whakaaro ahau mō te haere ki Ahitereiria ā te tau kei te heke mai. Kei reira ōku hoa maha. E hiahia ana ahau ki te kite i a rātou, ki te toro i ngā wāhi hou hoki", "english": "I am thinking about going to Australia next year. Many of my friends are there. I want to see them and also visit new places" },
  { "maori": "Ko tōku tungāne, he kaipūkaha ia. Ia rā, ka haere ia ki te whare kaipūkaha ki te whakapakari i tōna tinana. Kua kaha rawa atu ia ināianei. E hiahia ana ia ki te whakauru ki tētahi whakataetae", "english": "My brother is an athlete. Every day, he goes to the gym to strengthen his body. He is very strong now. He wants to enter a competition" },
  { "maori": "Ā te Hatarei, ka haere au ki te mākete. Ka hoko au i ngā huawhenua hou me ngā huarākau mai i ngā kaiwhakamahi whenua o te rohe. He pai ake te kai hou ki te kai o te toa", "english": "On Saturday, I go to the market. I buy fresh vegetables and fruit from local farmers. Fresh food is better than shop food" },
  { "maori": "Kei te ako ahau ki te whakairo rākau. Kei te āwhina taku koroua i ahau. He tohunga whakairo ia, ā, e mārama ana ia ki ngā tikanga katoa o te mahi. He uaua te mahi, engari he pai", "english": "I am learning wood carving. My grandfather is helping me. He is a master carver and knows all the protocols of the work. The work is difficult, but good" },
  { "maori": "I te marama kua pahure, i haere au ki tētahi wānanga reo Māori. He wiki tonu te roa. I ako mātou i ngā kupu hou maha, i ngā waiata, me te tikanga Māori. He wheako miharo tērā", "english": "Last month, I went to a Māori language course. It was a whole week long. We learned many new words, songs, and Māori customs. That was an amazing experience" },
  { "maori": "Ko taku whaea, he kaitiaki tamariki ia i te kōhanga reo. He pai ki a ia te mahi me ngā tamariki. Ia rā, ka whakaako ia i te reo Māori ki ngā tamariki ririki", "english": "My mother is a childcare worker at the kōhanga reo. She likes working with children. Every day, she teaches Māori language to little children" },
  { "maori": "Kei te whakarite ahau i tētahi pāti mō taku rā whānau ā te wiki kei muri. Ka karanga au i aku hoa katoa me taku whānau. Ka tunu au i ngā kai maha, ā, ka waiata, ka kanikani tātou katoa", "english": "I am organizing a party for my birthday next week. I will invite all my friends and my family. I will cook lots of food, and we will all sing and dance" },
  { "maori": "Kei te haere taku tama ki te kura tuarua. Kei te ako ia i ngā marau pāmu, pēnei i te pāngarau, te pūtaiao, me te hītori. He pai ki a ia te kanikani hoki, nō reira kei te uru ia ki ngā akoranga kanikani", "english": "My son goes to secondary school. He is studying several subjects, such as mathematics, science, and history. He also likes dancing, so he is joining dance classes" },
  { "maori": "Kei te mahi ahau i te whare kai. He tino pukumahi taku mahi, tino haere tonu i ngā wā katoa. Heoi, he pai ki ahau te mahi me aku hoa mahi. He pai te āhua o te whakahaere", "english": "I work in a restaurant. My work is very busy, constantly going all the time. However, I like working with my colleagues. The management is good" },
  { "maori": "I te marama o Hūrae, ka haere au ki tētahi hui whakapakari i Rotorua. E toru ngā rā tērā. Ka whakapakari au i ōku pūkenga mahi me te whakawhiti kōrero ki ētahi atu tangata mai i ngā wāhi katoa o te motu", "english": "In July, I am going to a training conference in Rotorua. It will be three days. I will improve my work skills and exchange information with other people from all over the country" },
  { "maori": "Ko taku kuia e noho ana i te kāinga awhina kaumātua. Ia wiki, ka haere au ki te toro i a ia. Ka kōrero māua mō ngā wā o mua, ka waiata hoki. He pai ki a ia te waiata tawhito", "english": "My grandmother lives in a rest home. Every week, I go to visit her. We talk about the old days and also sing. She likes old songs" },
  { "maori": "Ā tēnei tau, ka haere taku whānau ki te noho puni i te ngahere. Ka mau tēneti mātou, ka tunu kai i te ahi, ka whānau ko ngā pikipiki hoki. He wā pai ki te noho ki te taiao", "english": "This year, my family is going camping in the forest. We will bring a tent, cook food on the fire, and go hiking. It is a good time to be in nature" },
  { "maori": "Kei te whakaaro ahau ki te huri ki te kai hūmārie. Kei te pīrangi ahau ki te noho hauora ake. Kāore au e hiahia ki te kai kīkōpū, nō reira ka kai au i te kai huawhenua me te huarākau", "english": "I am thinking about changing to vegetarian food. I want to be healthier. I don't want to eat meat, so I will eat vegetables and fruit" },
  { "maori": "I te pō o te Rāmere, i haere mātou ki te konohete. I waiata tētahi pēne rongonui mai i Aotearoa. I whakatū mātou i te mua, ā, i kanikani tātou katoa. He pō miharo tērā", "english": "On Friday night, we went to a concert. A famous band from New Zealand sang. We stood at the front, and we all danced. That was an amazing night" },
  { "maori": "Ko taku whānau me au, e noho ana mātou i te pā harakeke. Kei konei ngā whare o aku mātua me aku tuakana. He pai ki a mātou te noho tata ki a rātou. Ka āwhina mātou i a rātou ia rā", "english": "My family and I live on a family compound. Here are the houses of my parents and my older siblings. We like living close to them. We help them every day" },
  { "maori": "Kei te whakahaere au i tētahi kaupapa hou i taku mahi. Kei te whai au i tētahi huarahi hou ki te whakapai ake i ngā āhuatanga o te ratonga. Me mahi tahi au me ētahi atu kaimahi", "english": "I am managing a new project at my work. I am pursuing a new way to improve aspects of the service. I need to work together with other staff members" },
  { "maori": "Kei te whakaaro taku hoa tāne ki te hoko i tētahi motokā hou. Kua tawhito te motokā o nāianei. He nui ake te whakamahinga o te hinu, ā, he nui ngā raruraru. Ka titiro ia i ngā motokā rerekē i tēnei wiki", "english": "My husband is thinking about buying a new car. The current car is old. It uses more petrol, and there are many problems. He will look at different cars this week" },
  { "maori": "I te marama kua pahure, i kite au i tētahi kararehe kīhai i kite i mua. He ataahua, he ātaahua ngā tae. I mau whakaahua au ki tērā. Ka whakaatu au i ngā whakaahua ki taku whānau", "english": "Last month, I saw an animal I had never seen before. It was beautiful, the colors were stunning. I took photos of it. I will show the photos to my family" },
  { "maori": "Kei te whakarite au i tētahi haerenga roa ki Te Tai Tokerau. Ka haere au mā te motokā me aku hoa. Ka noho mātou i ngā wāhi rerekē ia pō. Ka toro mātou i ngā moana me ngā maunga", "english": "I am organizing a long trip to Northland. I will go by car with my friends. We will stay in different places each night. We will visit the beaches and mountains" },
  { "maori": "Ko taku tuahine, kua hoki ia ki te kura wānanga ki te ako i tētahi mea hou. E hiahia ana ia ki te whakahou i ana mōhiotanga. Kei te ako ia i te ahuwhenua me te tiaki taiao", "english": "My sister has returned to university to learn something new. She wants to refresh her knowledge. She is studying agriculture and environmental care" },
  { "maori": "Kei te tino māuiui taku ngeru. I te rā nei, ka kawe au i a ia ki te rata kararehe. Kei te tūmanako ahau ka pai ia. He taonga nō taku whānau tērā ngeru", "english": "My cat is very sick. Today, I will take her to the vet. I hope she will be okay. That cat is a treasure of my family" },
  { "maori": "Ko taku mahi, he kaituhi au. Kei te tuhi au i ngā pakiwaitara, ngā tuhinga, me ngā whakaahua. He pai ki ahau taku mahi nō te mea he mahi auaha. Ka noho au i te kāinga, ka mahi mai i konei", "english": "My work is as a writer. I write stories, articles, and descriptions. I like my work because it is creative work. I stay at home and work from here" },
  { "maori": "I mua i te tekau tau, i haere au ki Te Waipounamu. I pikitia e au te Maunga Aorangi. He uaua te piki, engari he ataahua te tirohanga mai i te tihi. Kāore ahau i wareware i tērā wheako", "english": "Ten years ago, I went to the South Island. I climbed Mount Cook. The climb was difficult, but the view from the summit was beautiful. I have not forgotten that experience" },
  { "maori": "Kei te whakaako au i te tamariki kapa haka i te kura. He ngākau aroha ahau ki te tikanga Māori me te whakahaere i ēnei momo kaupapa. Ka haere mātou ki ngā whakataetae ia tau", "english": "I teach children kapa haka at school. I am passionate about Māori customs and managing these types of projects. We go to competitions every year" },
  { "maori": "Ko taku matua kēkē, he kaimahi pamu ia. Kei te mahi ia i runga i tōna ake pamu. He hipi maha tāna me ngā kau. Ia tau, ka tiaki ia i ngā kararehe, ka whakato kai hoki", "english": "My uncle is a farm worker. He works on his own farm. He has many sheep and cattle. Every year, he looks after the animals and also plants food" },
  { "maori": "Kei te whakahaere taku māmā i tētahi tari paku i te taone. He kaimahi utu ia. Ia rā, ka āwhina ia i ngā kiritaki me ngā uiui mō te moni. He pai ki a ia tana mahi", "english": "My mother manages a small office in town. She is an accountant. Every day, she helps clients with questions about money. She likes her work" },
  { "maori": "Kei te ako au ki te reo Pāniora. He hiahia nōku ki te haere ki te haere ki Hepania. Kei te whakaaro au ko te reo tuarua he mea nui i te ao o nāianei", "english": "I am learning Spanish language. It is my desire to go to Spain. I think a second language is important in today's world" },
  { "maori": "Ko taku tamaiti, he tino pai ia ki te whakairo. Kei te ako ia i te whakairo rino me te whakairo rākau. Kua tohua ia ki tētahi akoranga motuhake i te kura wānanga", "english": "My child is very good at carving. They are learning metal carving and wood carving. They have been selected for a special course at the university" },
  { "maori": "I te pō inanahi, ka tunu au i tētahi kai Haina mō taku whānau. He uaua te tunu, engari i pai te mutunga. I kai tātou katoa, ā, i reka ki a rātou katoa", "english": "Last night, I cooked Chinese food for my family. The cooking was difficult, but the result was good. We all ate, and they all liked it" },
  { "maori": "Kei te whakatū au i tētahi pakihi paku ki te hoko taonga toi Māori. Kei te hanga au i ngā mea katoa ki ōku ringaringa. Ka tuwhera te toa i te marama kei te heke mai", "english": "I am setting up a small business to sell Māori art items. I am making everything with my own hands. The shop will open next month" },
  { "maori": "Ko taku koroua, he kaumātua ia o te marae. He tohunga ia ki ngā tikanga me ngā kawa o te marae. Ka karanga ia i ngā manuhiri, ka whaikōrero hoki. He tangata nui ia i roto i te hapori", "english": "My grandfather is an elder of the marae. He is an expert in the protocols and ceremonies of the marae. He calls to the visitors and also makes speeches. He is an important person in the community" },
  { "maori": "Kei te whakaako taku hoa wahine i te kura tuarua. He kaiako ia mō te reo Ingarihi me te hītori. He pai ki a ia te mahi me ngā rangatahi, engari he uaua ētahi wā", "english": "My wife teaches at secondary school. She is a teacher of English language and history. She likes working with young people, but it is difficult sometimes" },
  { "maori": "Kei te whakarite ahau i tētahi kanikani nui mō te hapori i te marae. Ka whakauru au i ngā tangata katoa, i ngā pakeke, i ngā rangatahi, me ngā tamariki. Ka mutu tēnei i te mutunga o te marama", "english": "I am organizing a big dance for the community at the marae. I will include everyone, the adults, the youth, and the children. This will finish at the end of the month" },
  { "maori": "I te tau kua pahure, i haere ahau ki Ingarangi hei mahi. I noho au i Rānana mō te tau kotahi. He wheako miharo tērā. I whakawhiti whakaaro au me ngā tāngata mai i ngā whenua katoa", "english": "Last year, I went to England for work. I lived in London for one year. That was an amazing experience. I exchanged ideas with people from all countries" },
  { "maori": "Ko taku tama, kei te tākaro ia i te poitarawhiti. He tino pai ia, ā, kei te kimi ia i tētahi tīma whakauru. E hiahia ana ia ki te tākaro i te taumata teitei ake", "english": "My son plays basketball. He is very good, and he is looking for a team to join. He wants to play at a higher level" },
  { "maori": "Kei te whakaako taku māmā i au ki te raranga harakeke. He mahi uaua tēnei, engari kei te ako au. Kua hangaia e au tētahi kete paku. Kei te koa ahau i tērā", "english": "My mother is teaching me to weave flax. This is difficult work, but I am learning. I have made a small basket. I am happy with that" },
  { "maori": "I tēnei wiki, kua pukumahi taku whānau ki te whakapaipai i te whare. Kua peita mātou i ngā pakitara, kua horoi i ngā matapihi, kua whakapaipai i te māra hoki. Kua pai te āhua o te whare", "english": "This week, my family has been busy beautifying the house. We have painted the walls, washed the windows, and also tidied the garden. The house looks good" },
  { "maori": "Ko taku hoa tawhito, kua haere ia ki te noho ki Ahitereiria. Kei te kimi ia i tētahi mahi hou ki reira. Kei te maumahara tonu ahau ki a ia. Ka tuhituhi māua ia wiki", "english": "My old friend has gone to live in Australia. They are looking for new work there. I still remember them. We write every week" },
  { "maori": "Kei te whakarite au i tētahi kaupapa ki te tiaki i te taiao o te rohe. E hiahia ana au ki te āwhina ki te tiaki i ngā awa, i ngā ngahere, me ngā moana. Ka tīmata tēnei i te marama kei te heke mai", "english": "I am organizing a project to protect the local environment. I want to help protect the rivers, forests, and oceans. This will start next month" },
  { "maori": "Ko taku whaea kēkē, he kaiwhakahaere ia o tētahi rōpū whakaari. Ka whakahaere ia i ngā kanikani, i ngā waiata, me ngā kiriata. He tangata auaha ia", "english": "My aunt is a manager of a performing arts group. She manages dances, songs, and films. She is a creative person" },
  { "maori": "Kei te ako taku tamāhine ki te kanikani parehe. Ia rā, ka haere ia ki ngā akoranga. He tino pai ia, ā, kua whiwhi ia i ngā tohu maha i ngā whakataetae", "english": "My daughter is learning ballet. Every day, she goes to classes. She is very good, and she has won many awards at competitions" },
  { "maori": "I tēnei marama, i haere taku whānau ki te hui whakanui i te rā whānau o taku tipuna. I karanga mātou i te whānau whānui katoa. I tunu mātou i te hāngi, ā, i waiata, i kanikani tātou katoa", "english": "This month, my family went to a celebration for my grandparent's birthday. We invited the whole extended family. We cooked a hāngi, and we all sang and danced" },
  { "maori": "Kei te whakahaere taku tungāne i tētahi rangatōpū ki te āwhina i ngā rangatahi. Ka whakaako ia i ngā rangatahi mō te mahi, te mātauranga, me te hauora. He mahi nui tāna", "english": "My brother manages an organization to help youth. He teaches young people about work, education, and health. His work is important" },
  { "maori": "Ko taku whānau, he whānau nui mātou. Tokowhā aku tuakana, tokorima aku teina. Ia tau, ka hui tātou katoa ki te marae mō ngā hararei. He wā rawe tēnā", "english": "My family is a large family. I have four older siblings and five younger siblings. Every year, we all gather at the marae for the holidays. That is a wonderful time" },
  { "maori": "Kei te whakaako au i taku tamaiti ki te hoe waka. He mahi uaua tēnei, engari he pai ki a ia. Kei te kaha haere ia. Ā te tau, ka whakauru pea ia ki tētahi whakataetae", "english": "I am teaching my child to paddle a waka. This is difficult work, but they like it. They are getting stronger. At the end of the year, they might enter a competition" },
  { "maori": "I te wiki kua pahure, i haere au ki te pouaka whakaatu ki te kite i tētahi kanikani a te rōpū Royal New Zealand Ballet. He ataahua! He rawe ngā kanikani katoa", "english": "Last week, I went to the theatre to see a dance by the Royal New Zealand Ballet group. It was beautiful! All the dances were excellent" },
  { "maori": "Ko taku mahi i te ahiahi, he kaiwhakahaere au i te whare kai. Ia ahiahi, ka whakahaere au i te kēpa, i ngā kaitunu kai, me ngā tangata e mahi ana i te whare kai", "english": "My work in the evening is as a restaurant manager. Every evening, I manage the cooks, the chefs, and the people working in the restaurant" },
  { "maori": "Kei te whakahaere au i tētahi wānanga mō te whānau ki te ako i te reo Māori. Ka haere mātou ia Rāhoroi. Ka ako mātou i ngā kupu hou, i ngā waiata, me ngā kōrero", "english": "I am organizing a course for the family to learn Māori language. We go every Saturday. We learn new words, songs, and conversations" },
  { "maori": "Ko taku hoa tane, he kaipōtae ia. Ia rā, ka haere ia ki runga o te moana ki te hī ika. He mahi uaua tēnei, engari he pai ki a ia. Ka hoki mai ia ki te kāinga me ngā ika maha", "english": "My husband is a fisherman. Every day, he goes out to sea to catch fish. This is hard work, but he likes it. He returns home with many fish" },
  { "maori": "Kei te whakarite ahau i tētahi haerenga ki te haere ki ngā motu o Te Moana-nui-a-Kiwa. E hiahia ana au ki te toro i Hāmoa, Tonga, me Fiti. Ka haere au ā te tau kei te heke mai", "english": "I am organizing a trip to go to the Pacific islands. I want to visit Samoa, Tonga, and Fiji. I will go next year" },
  { "maori": "Ko taku kuia, he tohunga rongoā ia. Kei te mōhio ia ki ngā rākau rongoā katoa. Ka āwhina ia i ngā tangata o te hapori ki te whakapai i ō rātou hauora mā ngā rongoā tawhito", "english": "My grandmother is a traditional healer. She knows all the medicinal plants. She helps people in the community to improve their health with traditional medicines" },
  { "maori": "I te marama kua pahure, i haere mātou ki tētahi hui ā-hapori i te marae. I kōrero mātou mō ngā take o te hapori, pēnei i te hauora, te mahi, me te oranga. He mea nui ēnei hui", "english": "Last month, we went to a community meeting at the marae. We talked about community issues, such as health, work, and wellbeing. These meetings are important" },
  { "maori": "Ko taku mahi i te ata, he kaipānui au i te whare pukapuka. Ka āwhina au i ngā tangata ki te rapu pukapuka, ki te whakamahi i ngā rorohiko, me te kimihanga. He pai ki ahau taku mahi", "english": "My work in the morning is as a librarian at the library. I help people find books, use computers, and do research. I like my work" },
  { "maori": "Kei te whakarite taku whānau i tētahi haerenga ki Te Urewera. Ka haere mātou ki reira ki te whakangahau, ki te mahi pikitia, ki te kimi i ngā manu hoki. He wāhi ataahua te Urewera", "english": "My family is organizing a trip to Te Urewera. We will go there to relax, do photography, and also look for birds. Te Urewera is a beautiful place" },
  { "maori": "Ko taku tamaiti, kei te ako ia i te pūtaiao ki te kura. He tino pai ia ki tēnei marau. E hiahia ana ia ki te haere ki te kura wānanga ki te ako i te mātai koiora", "english": "My child is learning science at school. They are very good at this subject. They want to go to university to study biology" },
  { "maori": "I te tau kua pahure, i haere taku pāpā ki te kōhanga reo hei kaimanaaki. Ka āwhina ia i te whāngai i ngā tamariki, i te whakaako i te reo Māori, me te mahi tahi me ngā mātua", "english": "Last year, my father went to the kōhanga reo as a helper. He helps feed the children, teach Māori language, and work together with the parents" },
  { "maori": "Kei te whakahaere au i tētahi kaupapa ki te whakapakari i ngā pūkenga mahi a ngā rangatahi. Ka whakaako au i a rātou mō te tuhi CV, te uiui mahi, me te whakahaere pēke", "english": "I am managing a project to develop the work skills of young people. I teach them about writing CVs, job interviews, and managing money" },
  { "maori": "Ko taku tuahine, he kaiwhakatere waka ia. Ia rā, ka haere ia ki te moana ki te whakatere. He tino pai ia, ā, kua whiwhi ia i ētahi tohu i ngā whakataetae", "english": "My sister is a waka navigator. Every day, she goes to the sea to sail. She is very good, and she has won some awards at competitions" },
  { "maori": "I te tau 2020, i haere taku whānau ki te noho ki Tāmaki Makaurau. Kua noho mātou i konei mō ngā tau rima. He pai ki a mātou te noho i konei, engari he maumahara tonu tātou ki tō mātou kāinga tuatahi", "english": "In 2020, my family went to live in Auckland. We have lived here for five years. We like living here, but we still remember our first home" },
  { "maori": "Kei te whakarite au i tētahi kaupapa ki te whakamana i te reo Māori i roto i ngā kura. E hiahia ana au ki te whakapakari i te ako o te reo i waenganui i ngā tamariki katoa", "english": "I am organizing a project to strengthen the Māori language in schools. I want to improve the learning of the language among all children" },
  { "maori": "Ko taku koroua, he kaiwhakawā ia mō ngā whakataetae kapa haka. He tohunga ia ki ngā tikanga o te kapa haka. Ka haere ia ki ngā whakataetae katoa i te motu", "english": "My grandfather is a judge for kapa haka competitions. He is an expert in the protocols of kapa haka. He goes to all the competitions around the country" },
  { "maori": "Kei te ako taku tama ki te hanga whare. Kei te haere ia ki te wharekura. I reira, ka ako ia i ngā pūkenga hanga, pēnei i te kamupene, te kaiwhiti, me te peita", "english": "My son is learning to build houses. He is going to trades school. There, he learns building skills, such as carpentry, electrician work, and painting" },
  { "maori": "Ko taku māmā, kei te whakatū ia i tētahi pakihi ki te hoko kai Māori tawhito. Ka tunu ia i ngā kai pēnei i te hangi, te rewena paraoa, me te kūmara. He reka ngā kai katoa", "english": "My mother is setting up a business to sell traditional Māori food. She cooks food such as hangi, rewena bread, and kumara. All the food is delicious" },
  { "maori": "I te marama kua pahure, i haere au ki Rākaipāka ki te toro i taku whānau. I noho au i reira mō te wiki kotahi. I haere mātou ki ngā wāhi tapu katoa, ā, i kōrero mātou mō te whakapapa", "english": "Last month, I went to Rākaipāka to visit my family. I stayed there for one week. We went to all the sacred places, and we talked about genealogy" },
  { "maori": "Kei te whakahaere taku tungāne i tētahi tari tohutohu mō te hauora hinengaro. Ka āwhina ia i ngā tangata e mate ana i te pōuritanga, i te āwangawanga, me ētahi atu mate hinengaro", "english": "My brother manages a counseling office for mental health. He helps people who suffer from depression, anxiety, and other mental illnesses" },
  { "maori": "Ko taku mahi i te ahiahi, he kaituhi au mō te rīpene o te rohe. Ka tuhi au i ngā pakiwaitara mō ngā kaupapa o te hapori, pēnei i te hauora, te mātauranga, me te taiao", "english": "My work in the evening is as a writer for the local newspaper. I write stories about community issues, such as health, education, and the environment" },
  { "maori": "Kei te whakahaere au i tētahi kaupapa ki te āwhina i ngā pakeke ki te ako i te reo Māori. Ia wiki, ka hui mātou ki te wharenui ki te ako. He pai ki a rātou katoa te ako", "english": "I am managing a project to help adults learn Māori language. Every week, we meet at the meeting house to learn. They all like learning" },
  { "maori": "Ko taku whaea, he kaiārahi ia mō te hui ā-whānau. Ka āwhina ia i ngā whānau ki te whakatau i ngā raru, ki te whakapakari i ngā hononga, me te whakapai i te oranga o te whānau", "english": "My mother is a facilitator for family meetings. She helps families resolve problems, strengthen relationships, and improve family wellbeing" },
  { "maori": "Kei te ako taku tamāhine ki te waiata ōpera. Kei te haere ia ki te kura puoro. He reo ataahua tāna, ā, e hiahia ana ia ki te waiata i ngā whare whakaari nui o te ao", "english": "My daughter is learning to sing opera. She is going to music school. She has a beautiful voice, and she wants to sing in the big theatres of the world" },
  { "maori": "I te tau kua pahure, i haere au ki tētahi wānanga mō te whakahaere pakihi. I ako au i ngā pūkenga maha, pēnei i te whakahaere pēke, te hokohoko, me te whakahaere tangata. He whakaako pai tērā", "english": "Last year, I went to a course on business management. I learned many skills, such as financial management, marketing, and people management. That was good teaching" },
  { "maori": "Ko taku tama, he kaiwhakairo ia. Kei te hanga ia i ngā whakairo rākau, i ngā whakairo rino, me ngā mahi toi maha. Ka hoko ia i ana mahi ki ngā kaihoko mai i ngā whenua katoa", "english": "My son is a carver. He makes wood carvings, metal carvings, and many art works. He sells his work to buyers from all countries" },
  { "maori": "Kei te whakarite au i tētahi hui nui mō te whānau ā te tau. Ka karanga au i te whānau whānui katoa mai i ngā wāhi katoa o Aotearoa. Ka noho tātou i te marae mō ngā rā e toru", "english": "I am organizing a big gathering for the family at the end of the year. I will invite the whole extended family from all places in New Zealand. We will stay at the marae for three days" },
  { "maori": "Ko taku koroua, he kaiwhakaako ia mō te whakaairo. Ka āwhina ia i ngā ākonga ki te ako i ngā tikanga o te whakaairo me ngā hangarau o mua. He tohunga ia", "english": "My grandfather is a teacher of carving. He helps students learn the protocols of carving and the ancient techniques. He is an expert" },
  { "maori": "Kei te whakahaere taku whānau i tētahi maara kai. Ka tipu mātou i ngā huawhenua, i ngā huarākau, me ngā otaota rongoā. Ka whāngai tēnei maara i te whānau katoa", "english": "My family is managing a food garden. We grow vegetables, fruit, and medicinal herbs. This garden feeds the whole family" },
  { "maori": "Ko taku hoa wahine, he kaitito ia. Ka tito ia i ngā pukapuka, i ngā pakiwaitara poto, me ngā kōrero mō ngā tamariki. Kua tā ia i ngā pukapuka maha, ā, he rongonui ia", "english": "My wife is an author. She writes books, short stories, and stories for children. She has published many books, and she is famous" },
  { "maori": "I te marama kua pahure, i haere taku pāpā ki te hōhipera. He mate tōna puku. Kua pai ia ināianei. Kei te hoki mai ia ki te kāinga ā te Rāmere", "english": "Last month, my father went to hospital. His stomach was sick. He is well now. He is returning home on Friday" },
  { "maori": "Kei te whakahaere au i tētahi kaupapa ki te tiaki i ngā manu o te rohe. Ka āwhina au ki te whakahaumanu i ngā nohoanga o ngā manu me te whakarite i ngā wānanga mō te hapori", "english": "I am managing a project to protect local birds. I help restore bird habitats and organize courses for the community" },
  { "maori": "Ko taku tuahine, he kaiwhakahaere ia i tētahi whare pukapuka. Ka whakahaere ia i ngā mahi katoa o te whare pukapuka, mai i te hoko pukapuka ki te whakahaere kaupapa ā-hapori", "english": "My sister is a manager of a library. She manages all the operations of the library, from buying books to managing community projects" },
  { "maori": "Kei te ako taku tamaiti ki te tākaro katoa. He tino pai ia ki te pōro rākau, ki te tēnehi, me te kauhoe. Ka tākaro ia i ngā tākaro maha ia wiki", "english": "My child is learning to play all sports. They are very good at cricket, tennis, and swimming. They play many sports every week" },
  { "maori": "I te tau kua pahure, i haere taku whānau ki te noho ki Te Tai Rāwhiti. Kua noho mātou i konei mō te tau kotahi. He ataahua te noho i konei, tata ki te moana me ngā maunga", "english": "Last year, my family went to live on the East Coast. We have lived here for one year. Living here is beautiful, close to the sea and mountains" },
  { "maori": "Ko taku koroua, he kaiwhakaako ia mō ngā tikanga me ngā kawa Māori. Ka haere ia ki ngā marae katoa o te rohe ki te whakaako i ngā tikanga tika. He tangata tino mōhio ia", "english": "My grandfather is a teacher of Māori customs and protocols. He goes to all the marae in the region to teach the correct protocols. He is a very knowledgeable person" },
  { "maori": "Kei te whakarite au i tētahi kaupapa whakapakari mō ngā kaimahi o taku tari. Ka whakahaere au i ngā wānanga ki te whakapakari i ō rātou pūkenga mahi, pūkenga whakahaere hoki", "english": "I am organizing a training program for the workers of my office. I will run courses to develop their work skills and also management skills" },
  { "maori": "Ko taku tama, he kaiwhakahaere ia i tētahi tīma whutupōro. Ia wiki, ka whakahaere ia i ngā whakamātautau me ngā whakatūtū. He tino kaha tana tīma, ā, kua whiwhi rātou i ētahi tohu", "english": "My son is a manager of a rugby team. Every week, he manages the practices and matches. His team is very strong, and they have won some awards" },
  { "maori": "Kei te whakahaere taku māmā i tētahi tari āwhina i ngā whānau. Ka āwhina ia i ngā whānau ki te whai i te āwhina hauora, te āwhina mahi, me te āwhina mō te kāinga", "english": "My mother manages an office that helps families. She helps families access health support, work support, and support for housing" }
]
